tutorials/immersedBoundary/pitzDailyLaminarIcoIbFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application icoDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          0.001;

// writeControl    timeStep;
writeControl    runTime;

writeInterval   0.003;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.2;

libs ( "libimmersedBoundary.so");

// functions
// (
//     immersedBoundaryForce
//     {
//         type               immersedBoundaryForce;
//         functionObjectLibs ("libimmersedBoundaryForceFunctionObject.so");
//         Aref 0.7854;
//         Uref 1;
//     }
// );

// ************************************************************************* //
